Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བསམ་གཏན་དང་། ལྷག་མཐོང་དང་མ་བྲལ་བས་ཉོན་མོངས་པ་དེ་དག་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར། གནས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on the threefold view is abiding in order to quell these defilements by not being separated from concentration and special insight.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བར་ཐབས་དང་ཤེས་རབ་ལ་མཁས་པས་ཡོངས་སུ་ཟིན་པས་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་གནས་པ་ནི་མ་ཡིན་གྱི། ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་ཤིང་སྨོན་ལམ་གྱི་དུས་སུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on the threefold view is to be endowed with knowledge of things as they are, but not as something static, and with the timely ripening of aspirations, in order to relinquish defilements by being taken hold of by expertise in skillful means and insight that are not in conflict with dependent origination.

source: འདི་དག་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the threefold view.

source: དེ་ལ་ལས་བྱས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections with respect to the performance of action?

source: བསྡུ་བའི་དངོས་པོ་དང་ལྡན་པས་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ལས་བྱས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on the performance of action is giving to sentient beings while practicing the four means of attracting disciples.

source: ཚུལ་ཁྲིམས་ཀྱིས་སྐྱེ་བོ་མང་པོ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ལས་བྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of discipline based on the performance of action is discipline that ripens many beings.

source: དཔེར་ན་སྲེག་པའི་སྐྱེས་པའི་རབས་ལས་མེ་བསད་པ་དང་། སེམས་ཅན་ཐར་བར་བྱས་པ་ལྟ་བུ་སྟེ།
en: An example of this is the extinguishing of fire and the rescue of many beings that occurred in the Bodhisattva’sprevious life as a quail.

source: དེ་ཡང་གང་གི་ཕྱིར་བལྟ་ཞེ་ན།
en: Why should that be regarded in such a way?

source: བསྡུ་བའི་དངོས་པོའི་ཕྱིར་སྐྱེ་བོ་རྣམས་ལ་སྙན་པར་སྨྲ་བའོ། །
en: Because here one uses pleasant speech for the sake of attracting disciples.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་གནས་པ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་ཀ་ལིང་ཀའི་རྒྱལ་པོས་ལུས་དུམ་བུ་བརྒྱད་དུ་གཏུབས་ཀྱང་བཟོད་པ་མ་བཏང་བ་དང་། ཇི་ལྟར་མགོ་བཅད་ཀྱང་སྡུག་བསྔལ་གྱི་ཚོར་བ་དང་དུ་ལེན་པའི་བར་དུ་སྦྱར་ཏེཐམས་ཅད་དུ་དཀའ་བ་སྤྱད་པ་དེ་ནི་ལས་བྱེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of patience based on the performance of action is the perfection of patience employed to ripen many beings. For example, this is the type of austerity performed when the King of Kaliṅga had the Bodhisattva’s body cut up into eight pieces, and the Bodhisattva did not forsake patience but accepted the pain even as he was decapitated.

source: བསྡུ་བའི་དངོས་པོའི་ཕྱིར་དོན་སྤྱོད་པའོ། །
en: Because here one accomplishes the objectives of others in order to attract disciples.

source: སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་སྟེ། དུས་ཤེས་པ་དང་ལྡན་པའི་བརྩོན་འགྲུས་ཀྱིས་སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ལ་སྐུལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ལས་བྱེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of diligence based on the performance of action is diligence that is timely and inspired by compassion, such that it ripens and inspires sentient beings.

source: བསྡུ་བའི་དངོས་པོའི་ཕྱིར་དོན་འཐུན་པའོ། །
en: Because here one acts in harmony with one’s words in order to attract disciples.

source: བསམ་གཏན་ཡོངས་སུ་སྦྱང་བར་མ་བྱས་ཤིང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པས་ཆོས་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ལས་བྱེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of concentration based on the performance of action is when one has not completed the training in concentration but is endowed with the perfection of insight such that there is no impediment with respect to any phenomenon.

source: རྣམ་པར་ཐར་པ་སྟོང་པ་ཉིད་ཀྱི་སྒོའི་ཕྱིར་རོ། །
en: Because of the liberation gate of emptiness.

source: ཤེས་རབ་ཀྱིས་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་རྨོངས་པ་མེད་པར་གནས་ཤིང་། སྐྱེ་བོ་མང་པོ་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་།
en: The perfection of insight based on the performance of action is to remain free from delusion about any virtuous factors by means of insight, so that one accepts numerous beings for the sake of awakening.

source: དངོས་པོ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་ལ་ཆུང་ངུ་ན་རྣམ་པར་ཐར་པ་སྨོན་པ་མེད་པའི་སྒོ་ཡོངས་སུ་བཟུང་བ་གང་ཡིན་པ་དེ་ནི་ལས་བྱེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: One has a lesser form of the correct understanding of things, and one embraces the liberation gate of wishlessness.

source: འདི་དག་ནི་ལས་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections based on the performance of action.

source: དེ་ལ་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of purification via the path?

source: ཡང་དག་པའི་ལྟ་བ་ལ་ཞུགས་ཤིང་ལྟས་དང་དགེ་མཚན་སྤངས་པའི་སྦྱིན་པ་དང་ལྡན་པ་མ་ཡིན་པར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on purification via the path is generosity that is dedicated to engaging with the true view while not abandoning signs and marks of virtue.

source: ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on purification via the path is discipline that is endowed with correct speech, correct livelihood, and correct action.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་མ་བཏང་བ་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on purification via the path is patience that does not give up the acceptance that phenomena are unborn.

source: ལུས་དང་སེམས་ལ་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on purification via the path is diligence that does not apprehend body or mind.

source: དམིགས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་མི་གཡེང་བ་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on purification via the path is concentration that is not distracted from absorption beyond apprehending.

source: མཚན་མར་འཛིན་པ་མེད་པས་ཤེས་རབ་ཡང་དག་པའི་ལྟ་བ་དང་ལྡན་ལ་ཡང་དག་པའི་དྲན་པ་བསྐྱེད་པས་བྱང་ཆུབ་ཕྱོགས་གཅིག་པ་མཐར་ཕྱིན་པར་བྱ་བ་དང་། ཕྱིར་མི་ལྡོག་པར་བྱ་བའི་ཕྱིར་གནས་པ་གང་ཡིན་པ་དེ་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on purification via the path is endowed with the insight of the correct view due to the absence of any grasping at marks and by engendering correct mindfulness. One thereby perfects the singular aspect of awakening and becomes irreversible from that state.

source: འདི་དག་ནི་ལམ་ཤིན་ཏུ་སྦྱངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of purification via the path.

source: དེ་ལ་བརྩོན་པ་མི་འདོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of untiring endeavor?

source: དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཐབས་མཁས་པས་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on untiring endeavor is to relinquish all things while skillfully dedicating this to awakening.

source: སེམས་ཅན་རྣམས་བདེ་འགྲོ་ཐོབ་པར་བྱ་བའི་ཕྱིར་མི་དམིགས་པ་སྔོན་དུ་བཏང་བ་ཉམས་པ་མེད་པའི་ཚུལ་ཁྲིམས་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་དགའ་ལྡན་ནས་
en: The perfection of discipline based on untiring endeavor is to observe flawless discipline preceded by an absence of apprehension and undertaken so all beings can attain the higher realms.

source: བྱང་ཆུབ་སེམས་དཔའ་འཆི་འཕོ་བ་ན་སྟོང་གསུམ་གཡོ་བ་དང་གནས་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཕུན་སུམ་ཚོགས་པ་འཛིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the case when, for example, a bodhisattva dies in the Heaven of Joy, and the trichiliocosm trembles as he takes birth in a pure and exquisite buddha realm.

source: བཟོད་པས་ཕ་རོལ་གྱི་དགེ་བའི་རྩ་བ་བསྒྲུབ་པའི་ཕྱིར་ཉེ་བར་གནས་ཤིང་འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མི་གོས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on untiring endeavor is to patiently cultivate the roots of virtue of others in a way that does not become stained by the eight worldly concerns.

source: བརྩོན་འགྲུས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་འཛིན་པ་དང་། སེམས་ཅན་རྣམས་ལ་བྱམས་པས་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on untiring endeavor is to diligently take hold of omniscient wisdom that is dedicated to all sentient beings with love.

source: སྙོམས་པར་འཇུག་པའི་རྣམ་པ་ཐམས་ཅད་བསྒྲུབ་པའི་བསམ་གཏན་ཚད་མེད་པ་ཡོངས་སུ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on untiring endeavor is to take hold of boundless concentration that accomplishes all aspects of meditative attainment.

source: ཆོས་ཐམས་ཅད་ལ་མཁས་པར་བྱ་བའི་ཕྱིར་དང་། གང་མངོན་པར་ཤེས་པས་ངེས་པར་འབྱུང་བའི་ཕྱིར་སྨོན་ལམ་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་པ་མི་འདོར་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on untiring endeavor is to abide in insight that is dedicated to a wish to attain expertise in all matters and deliverance by means of superknowledge.

source: འདི་དག་ནི་བརྩོན་པ་མི་འདོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of untiring endeavor.

source: དེ་ལ་རིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of reasoning?

source: མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on reasoning is generosity imbued with nirvāṇa.

source: འདོད་ཆགས་དང་བྲལ་བར་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on reasoning is discipline dedicated in a way that is free of desire.

source: འགོག་པར་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on reasoning is patience that is dedicated to cessation.

source: ཉེ་བར་ཞི་བ་རྩོམ་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on reasoning is diligence that engages in pacification.

source: ལྟ་བར་གྱུར་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། ཉོན་མོངས་པ་འཇོམས་པར་བྱེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on reasoning is concentration that quells views and conquers emotional defilements.

source: སྔགས་དང་། སྨན་དང་། གཙུག་ལག་དང་། ས་གཡོ་བ་ཤེས་པ་དང་། དུས་ཚིགས་དང་། ལོ་ཤེས་པ་དང་། ཡི་གེ་ཤེས་པ་དང་། མངོན་པར་ཤེས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། བདེ་འགྲོ་དང་། ངན་འགྲོའི་ལས་རྗེས་སུ་ཤེས་པར་གནས་ཤིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱིར་མངོན་པར་ཞེན་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on reasoning is to have the perfection of insight that is free from attachment in order to maintain the knowledge pertaining to mantras, medicines, sciences, earthquakes, seasons, years, letters, superknowledges, great compassion, and the actions associated with the higher and lower realms, and thus to be omniscient.

source: འདི་དག་ནི་རིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྟེ།
en: Such are the six perfections of reasoning,

source: དེ་དག་ནི་མི་འཇིགས་པ་བཞི་ལས་བལྟ་བར་བྱའོ། །
en: which are to be regarded in terms of the four types of fearlessness.

source: དེ་ལ་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections based on what should be done?

source: སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་ཡོངས་སུ་བསྔོ་ཞིང་བདག་ཉིད་ཀྱང་སྦྱིན་པ་བྱེད་ལ་གཞན་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on what should be done is generosity that is dedicated to benefiting others, as one both gives to others and causes others to practice generosity.

source: སེམས་ཅན་ལ་དམིགས་པའི་བྱམས་པ་བསྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on what should be done is the cultivation of love focused on sentient beings.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on what should be done is the patient reliance on the ripening of karma.

source: དགེ་བ་བཅུ་དང་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on what should be done is diligence endowed with the ten virtues.

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: The perfection of concentration based on what should be done is concentration focused on impermanence, suffering, and the absence of self.

source: དགེ་བའི་ཆོས་རྣམས་ཆུད་མི་ཟ་བར་བྱ་བ་དང་། མི་དགེ་བའི་ཆོས་རྣམས་སྤང་བར་བྱ་བའི་ཕྱིར་ཐབས་མཁས་པས་སྐྱེ་བོ་མང་པོ་ལ་ཕན་འདོགས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on what should be done is insight that skillfully benefits numerous beings, ensuring that virtuous factors are not wasted and unvirtuous factors are relinquished.

source: འདི་དག་ནི་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections based on what should be done.

source: དེ་ལ་བྱ་བ་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections based on what should not be done?

source: འདོད་པའི་ཡོན་ཏན་གྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བར་གཏོགས་པ་མ་ཡིན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on what should not be done is the practice of ripening sentient beings by means of sense pleasures.

source: བྱ་བ་མ་ཡིན་པའི་འབྱུང་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline concerning what should not be done is discipline that involves what should not be done.

source: སྲེད་པས་ཡོངས་སུ་བསྔོས་ཤིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཡུལ་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on what should not be done is to tolerate objects that ripen sentient beings and make dedications with craving.

source: འཇིག་རྟེན་པའི་གད་མོ་དང་། དགའ་བ་དང་། རྩེད་མོ་དང་། སྔགས་དང་། སྨྲ་བ་དང་། བརྗོད་པ་དང་། ཆོ་ལོ་དང་། རྒྱན་པོ་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on what should not be done is to ripen sentient beings by means of mundane jokes, enjoyment, play, mantra, speech, expressions, dice games, gambling, and material goods.

source: བཏང་སྙོམས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གིས་ཕྱེ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on what should not be done is concentration that is distinguished in terms of neutrality and the factors of awakening.

source: ཤིན་ཏུ་སྦྱངས་པ་དང་ལྡན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དཔེར་ན་རྒྱལ་པོའི་བུ་བླུན་པོ་ལྐུགས་པ་ལྟ་བུ་སྟེ།
en: The perfection of insight based on what should not be done is insight that has become extremely disturbed, as in the case of a prince who was dull and mute.

source: འདི་དག་ནི་བྱ་བ་མ་ཡིན་པར་གཏོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections based on what should not be done.

source: དེ་ལ་རློམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections based on conceit?

source: ཡོངས་སུ་བསྔོ་བ་དང་བྲལ་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on conceit is giving that lacks dedication.

source: བདག་ཚུལ་ཁྲིམས་དང་ལྡན་པ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on conceit is the dedication of one’s own discipline to awakening.

source: ང་རྒྱལ་དང་ལྡན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on conceit is a proud patience.

source: རྩོམ་པ་རྒྱས་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on conceit is an endeavor to elaborate.

source: སྒོམ་ཞིང་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on conceit is concentration that is sporadic.

source: ཐོས་པའི་བདག་ཉིད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་རློམ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on conceit is learning dedicated to awakening.

source: འདི་དག་ནི་རློམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྟེ།
en: Such are the six perfections based on conceit.

source: དེ་ག་ལས་བལྟ་ཞེ་ན།
en: From which perspective are those to be regarded?

source: ཆོས་མཉན་པ་དག་ལས་སོ། །
en: From the perspective of someone listening to the Dharma.

source: དེ་ལ་བརྩམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of application?

source: དངོས་པོ་ཐམས་ཅད་ལ་མི་བལྟ་བར་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོར་ལུས་ཡོངས་སུ་གཏོང་བ་ལྟ་བུ་སྟེ། དེ་ནི་བརྩམས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on application is an unreserved giving of everything, as when, for example, a hero sacrificed his life in the ocean for the sake of sentient beings.

source: ཚུལ་ཁྲིམས་ཀྱི་རང་བཞིན་ལྟ་བ་དང་རྒོད་པ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩམས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on application is discipline that has given up views and agitation.

source: ཐ་ན་མགོ་བཅད་ཀྱང་མི་འཁྲུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩམས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on application is undeterred acceptance even if one’s head is cut off.

source: བྱ་བ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ། རྩོམ་པ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་བསྐམ་པར་འབད་པ་ལྟ་བུ་སྟེ། དེ་ནི་བརྩམས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on application is to endeavor in ways that are greater than all other pursuits, like the endeavor to dry up the ocean, for example.

source: བཙུན་མོའི་འཁོར་གྱི་ནང་ན་གནས་ཀྱང་། བསམ་གཏན་བཞི་ཆུད་མི་ཟ་བ་གང་ཡིན་པ་དེ་ནི་བརྩམས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on application is concentration that is not wasted even if one remains within a harem.

source: འདུ་བྱེད་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་མཐོང་བ་དང་ལྡན་ཞིང་ཟབ་མོ་མི་དམིགས་པ་དང་ལྡན་པའི་ཤེས་རབ་རྨོངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩམས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on application is unobscured insight that sees all conditioned things to be like illusions and is endowed with profound nonapprehension.

source: འདི་དག་ནི་བརྩམས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྟེ། དེ་དག་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལས་བལྟ་བར་བྱའོ། །
en: Such are the six perfections of application, which are to be regarded from the perspective of the four bases of miraculous power.

source: དེ་ལ་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of virtue?

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་འཇོམས་པར་བྱེད་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on virtue is generosity that destroys the chain links of karmic imprints.

source: འཕགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕྱིར་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་གནས་པ་དང་། བག་མེད་པ་རྣམ་པར་སྦྱོང་བ་དང་། ངན་འགྲོ་སེལ་བ་ལ་ཉེ་བར་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on virtue relinquishes everything for the sake of the discipline of noble beings, purifies carelessness, and eliminates the lower realms.

source: ཐམས་ཅད་ལ་བཟོད་ཅིང་དགེ་བའི་ཆོས་ལ་རྩོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on virtue accepts everything and does not dispute any virtuous factor.

source: བྱ་བར་གཏོགས་པ་ཐམས་ཅད་ལ་བརྩོན་འགྲུས་ཞུམ་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on virtue is unrelenting diligence based on all that is to be done.

source: བསམ་གཏན་གྱི་ངོ་བོ་ཉིད་ཡུལ་མཉམ་པ་ཉིད་ལ་ཞུགས་པ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་སེམས་གདུལ་བའི་ཕྱིར་གནས་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of concentration based on virtue is to practice the essence of concentration within the sphere of equality in order to discipline the mind so it accords with one’s intentions.

source: དཔེར་ན་རྒྱལ་པོ་ཆེན་པོ་ལེགས་མཐོང་འདོད་པའི་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པ་དག་ལས་འདས་པ་ལྟ་བུའོ། །
en: An example of this is the way the great king Sudarśana transcended thoughts of desire, malice, and harm.

source: ཐམས་ཅད་ལ་མི་གནས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on virtue is insight that does not fixate on anything.

source: དེ་ཡང་སྙིང་རྗེ་ཆེན་པོ་ལས་བལྟ་བར་བྱ་བ་སྟེ། འདི་དག་ནི་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of virtue, which should be considered from the perspective of great compassion.

source: དེ་ལ་རྣོ་བས་ཕྱེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of sharpness?

source: མི་དམིགས་པ་ལ་གནས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on sharpness is generosity that abides by nonapprehension.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རློམ་སེམས་མེད་ཅིང་དངོས་པོ་བཅབས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on sharpness is unpretentious discipline that does not conceal anything.

source: ཆོས་ཐམས་ཅད་ལ་ཇི་ལྟ་བ་བཞིན་དུ་བཟོད་ཅིང་ཕྱིན་ཅི་ལོག་མེད་པས་བསྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on sharpness accepts all phenomena just as they are and is engendered by means of freedom from error.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་ལ་ཕྱིར་ཟློགས་པ་མེད་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on sharpness is an irreversible endeavor in accordance with one’s aspirations.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on sharpness is the perfection of concentration embraced by the perfection of insight.

source: བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཉན་ཐོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་མ་ལུས་པར་ཤེས་ཤིང་། རང་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་མ་ལུས་པ་ཤེས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བ་ཡང་མ་ཡིན། སོ་སོའི་སྐྱེ་བོ་ཡང་མ་ཡིན། སྦྱིན་གནས་ཀྱང་མ་ཡིན་ལ། སྨོན་ལམ་གྱིས་སྐྱེ་བ་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྣོ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on sharpness consists in a bodhisattva knowing all the perfections of the hearers and solitary buddhas but not becoming dispassionate or being an ordinary person or a recipient of donations, and not having any attachments with respect to the process of taking birth by means of aspiration prayers.

source: འདི་དག་ནི་རྣོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of sharpness.

source: དེ་ལ་ཟབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of profundity?

source: མི་དམིགས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Profound perfection of generosity is generosity free from objective references.
